CSI API ETABS v1
cPropFrame.Count Method
 Retrieves the total number of defined frame section properties in the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Count(
	eFramePropType PropType =
)
Function Count (
	Optional PropType As eFramePropType =
) As Integer
Dim instance As cPropFrame
Dim PropType As eFramePropType
Dim returnValue As Integer
returnValue = instance.Count(PropType)
int Count(
	eFramePropType PropType =
)
abstract Count :
        ?PropType : eFramePropType
(* Defaults:
        let _PropType = defaultArg PropType
*)
-> int
Parameters
PropType (Optional)
Type: ETABSv1.eFramePropType
This optional value is one of the items in the eFramePropType enumeration.
If no value is input for PropType, a count is returned for all frame section properties in the model regardless of type.
Return Value
Type: Int32
Returns the total number of defined frame section properties in the model. If desired, counts can be returned for all frame section properties of a specified type in the model.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Count As Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'return number of defined frame section properties of all types
       Count = SapModel.PropFrame.Count
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace